---
kind: type
id: T:Autodesk.Revit.DB.TextNoteLeaderStyles
source: html/c2995bab-88b2-5ee3-4559-0aff2cf5c039.htm
---
# Autodesk.Revit.DB.TextNoteLeaderStyles

An enumerated type listing all the Leader styles.

## Syntax (C#)
```csharp
public enum TextNoteLeaderStyles
```